not_registered_yet = text = """Щоб продовжити навчання, необхідно заповнити форму. Це обов’язковий крок – без нього ми не зможемо зареєструвати тебе в системі та надати доступ до матеріалів.


📌 <b>Чому це важливо?</b>

✅ Форма допомагає нам краще розуміти тебе та твої потреби.
✅ Без неї ти не зможеш отримати доступ до курсу.
✅ Це всього кілька хвилин – але важливий крок на твоєму шляху.


🔹 <b>Що робити далі?</b>

1️⃣ Натисни кнопку <b>«Заповнити анкету»</b>.
2️⃣ Відповідай на запитання – це швидко!
3️⃣ Повернися сюди та натисни <b>«Я заповнив/ла анкету»</b>, щоб рухатися далі.


🚀 Готовий? Натискай кнопку нижче та заверши цей важливий крок!
"""


pay_text = """🚀 <b>Останній крок перед стартом!</b>

Розвиток потребує інвестицій – часу, зусиль і фінансів. Ти платиш лише раз і відразу отримуєш доступ до всіх матеріалів та підтримки спільноти.

💳 <b>Оплата безпечна та проста!</b> Ми використовуємо <b>WayForPay</b> – перевірену платіжну систему. Після оплати повернись у Telegram та дотримуй інструкцій у боті.

🔹 <b>Як оплатити?</b> 

1️⃣ Натисни "💳 Оплатити" – тебе перекине на WayForPay. 
2️⃣ Введи свої платіжні дані та підтвердь оплату. 
3️⃣ Повернись у Telegram, дочекайся повідомлення про успішну оплату і почни навчання!

🌟 <b>Не зволікай – розпочни навчання вже зараз!</b>
"""

failed_test = """🙂 Не засмучуйся — цього разу трохи не вистачило балів.

Спробуй пройти тест ще раз — у тебе обов’язково вийде! 🚀

👉 Порада: щоб переглянути правильні відповіді, натисни «Переглянути оцінку» після завершення тесту в Google Формах. Ознайомся із результатами та повернися до повторного проходження. Ти на правильному шляху! 🌿
"""

test_not_passed = """🙁 <b>Результат проходження тесту не знайдено.</b>

⏳ Якщо ви пройшли тест <u>менше ніж 3 хвилини тому</u>, будь ласка, зачекайте та спробуйте знову пізніше. Підвантаження результату може займати до 5 хвилин.

⚠️ <b>Переконайтеся, що ви вказали <u>той самий email, що й при реєстрації</u>. Якщо ви використали інший email, потрібно пройти тест з тим email, який вказували під час реєстрації в боті.</b>"""

how_learn = ("🎉 <b>Привіт! Раді бачити тебе тут!</b>\n"
             "Ти вже тут – це означає, що готовий навчатися та зростати. Зараз ми розберемося, як проходить навчання, як користуватися платформою та що потрібно зробити, щоб отримати максимум від курсу!\n"
             "\n<b>🔹 Як працює навчання?</b>\n "
             "\n✅ Курс складається <b>з 6 модулів</b>, і кожен з них <b>триває 2 тижні.</b>"
             "\n✅ <b>Уроки відкриваються поступово</b> – більшість уроків містять кілька відео та тестів. Спочатку переглядаєш відео, проходиш тест, а після успішного складання <b>(80%</b> правильних відповідей) відкривається наступний урок."
             "\n✅ <b>Швидше пройти курс не вийде</b> – навіть якщо ти закінчив модуль раніше, доступ до наступного відкриється не раніше ніж через 2 тижні. "
             "\n✅ <b>Якщо не встиг за дедлайном</b>, доступ до навчання призупиняється. У тебе є 7 днів, щоб звернутися у підтримку (відновлення можливе лише раз і за поважних причин). Інакше доведеться почати спочатку.\n"
             "\n📌 <b>Що робити, якщо виникли питання?</b>\n "
             "🔹 Переглянь розділ <b>'Питання та відповіді'</b> – там зібрані найпоширеніші запитання."
             "\n🔹 Якщо відповіді немає – напиши в підтримку.\n"
             "\n💡 Будь зосередженим, <b>дотримуйся темпу</b> та отримуй максимум від навчання! Бот буде надсилати нагадування, тому <b>слідкуй за повідомленнями</b> та не відкладай навчання.")

why_need_text = ("🚀 <b>Чи кличе тебе Бог до заснування церкви?</b>\n"
                                                "\nТи відчуваєш, що Бог може кликати тебе до більшого, але не знаєш, з "
                                                "чого почати? Чи активно ділишся Євангелієм, дбаєш про людей, прагнеш "
                                                "змін у своїй громаді, але не впевнений, чи варто тобі засновувати "
                                                "церкву? <b>M4 Інтенсив</b> – це 90-денний інтерактивний онлайн-курс у "
                                                "Telegram, створений саме для тих, хто шукає відповіді на ці питання "
                                                "та прагне зробити впевнені перші кроки у своєму покликанні.\n"
                                                "\n🔹 <b>Що ти отримаєш?</b> \n"
                                                "\n ✅ 6 ключових модулів, що проведуть тебе від розпізнавання "
                                                "покликання до практичного служіння.\n"
                                                "✅ Лаконічні відеоуроки та інтерактивні завдання для застосування "
                                                "знань у реальному житті.\n"
                                                "✅ Структурований підхід, що допоможе рухатися вперед у зручному темпі"
                                                " без хаосу та перевантаження.\n"
                                                "✅ Онлайн-спільнота, де ти знайдеш підтримку, натхнення та відповіді"
                                                " на свої питання.\n"
                                                "✅ Регіональні зустрічі для знайомства, обміну досвідом та зміцнення"
                                                " у покликанні.\n"
                                                "\n🎯 <b>Для кого цей курс?</b>\n"
                                                "\n<b>-</b> Для тих, хто хоче зрозуміти, чи дійсно Бог кличе їх"
                                                " засновувати церкву.\n"
                                                "<b>-</b> Для молодих лідерів, які шукають своє місце в служінні.\n"
                                                "<b>-</b> Для тих, хто хоче навчитись вести команду та розвивати"
                                                " здорову церкву.\n"
                                                "\n 📌 <b>Якщо ти прагнеш знайти чітке бачення свого покликання – ця"
                                                " програма для тебе!</b> Натискай 'Реєстрація' та ставай частиною "
                                                "цього шляху.")

program_text = ("\n<b>Що ти отримаєш під час навчання?</b>\n"
                                  "M4 Ready – це 90-денний інтерактивний онлайн-курс у Telegram, який допоможе тобі зрозуміти, чи кличе тебе Бог до заснування церкви, та дасть чіткий план подальших кроків у служінні.\n"
                                  "\n<b>🔹 Що включає навчання?</b>\n"
                                  "✅ <b>6 ключових модулів</b> – усе, що потрібно для розвитку лідерства, команди та бачення церкви.\n"
                                  "✅ <b>Практичні відеоуроки</b> – стисла, структурована інформація без води.\n"
                                  "✅ <b>Інтерактивні завдання</b> – не просто слухай, а застосовуй знання в реальних ситуаціях.\n"
                                  "✅ <b>Онлайн-спільнота</b> – підтримка та натхнення від інших учасників курсу.\n"
                                  "✅ <b>Регіональні зустрічі</b> – живе спілкування, обмін досвідом і натхнення.\n"
                                  "✅ <b>Гнучкий формат</b> – навчайся в зручному ритмі, коли тобі комфортно.\n"
                                  "✅ <b>Конкретний план дій</b> – отримаєш зрозумілий алгоритм створення та розвитку громади.\n"
                                  "✅ <b>Досвід практиків</b> – навчання від лідерів, які вже заснували церкви.\n"
                                  "✅ <b>Фокус на результат</b> – лише те, що дійсно працює у сучасному служінні.\n"
                                  "\n🎯 <b>Для кого цей курс?</b>\n"
                                  "\n <b>-</b> Для тих, хто хоче зрозуміти, чи кличе їх Бог до заснування церкви.\n"
                                  "<b>-</b> Для молодих лідерів, які шукають своє місце в служінні.\n"
                                  "<b>-</b> Для тих, хто прагне навчитись ефективно вести команду та будувати громаду.\n"
                                  "\n📌<b> Якщо ти шукаєш ясність у покликанні та чіткі кроки для служіння – цей курс для тебе!</b>\n"
                                  "\nНатискай 'Реєстрація' та приєднуйся до навчання🚀")

