not_registered_yet = text = """Щоб продовжити навчання, необхідно заповнити форму. Це обов’язковий крок – без нього ми не зможемо зареєструвати тебе в системі та надати доступ до матеріалів.


📌 <b>Чому це важливо?</b>

✅ Форма допомагає нам краще розуміти тебе та твої потреби.
✅ Без неї ти не зможеш отримати доступ до курсу.
✅ Це всього кілька хвилин – але важливий крок на твоєму шляху.


🔹 <b>Що робити далі?</b>

1️⃣ Натисни кнопку <b>«Заповнити анкету»</b>.
2️⃣ Відповідай на запитання – це швидко!
3️⃣ Повернися сюди та натисни <b>«Я заповнив/ла анкету»</b>, щоб рухатися далі.


🚀 Готовий? Натискай кнопку нижче та заверши цей важливий крок!
"""


pay_text = """🚀 <b>Останній крок перед стартом!</b>

Розвиток потребує інвестицій – часу, зусиль і фінансів. Ти платиш лише раз і відразу отримуєш доступ до всіх матеріалів та підтримки спільноти.

💳 <b>Оплата безпечна та проста!</b> Ми використовуємо <b>WayForPay</b> – перевірену платіжну систему. Після оплати повернись у Telegram та дотримуй інструкцій у боті.

🔹 <b>Як оплатити?</b> 

1️⃣ Натисни "💳 Оплатити" – тебе перекине на WayForPay. 
2️⃣ Введи свої платіжні дані та підтвердь оплату. 
3️⃣ Повернись у Telegram, дочекайся повідомлення про успішну оплату і почни навчання!

🌟 <b>Не зволікай – розпочни навчання вже зараз!</b>
"""

failed_test = """🙂 Не засмучуйся — цього разу трохи не вистачило балів.

Спробуй пройти тест ще раз — у тебе обов’язково вийде! 🚀

👉 Порада: щоб переглянути правильні відповіді, натисни «Переглянути оцінку» після завершення тесту в Google Формах. Ознайомся із результатами та повернися до повторного проходження. Ти на правильному шляху! 🌿
"""

test_not_passed = """🙁 <b>Результат проходження тесту не знайдено.</b>

⏳ Якщо ви пройшли тест <u>менше ніж 3 хвилини тому</u>, будь ласка, зачекайте та спробуйте знову пізніше. Підвантаження результату може займати до 5 хвилин.

⚠️ <b>Переконайтеся, що ви вказали <u>той самий email, що й при реєстрації</u>. Якщо ви використали інший email, потрібно пройти тест з тим email, який вказували під час реєстрації в боті.</b>"""

how_learn = ("🎉 <b>Привіт! Раді бачити тебе тут!</b>\n"
             "Ти вже тут – це означає, що готовий навчатися та зростати. Зараз ми розберемося, як проходить навчання, як користуватися платформою та що потрібно зробити, щоб отримати максимум від курсу!\n"
             "\n<b>🔹 Як працює навчання?</b>\n "
             "\n✅ Курс складається <b>з 6 модулів</b>, і кожен з них <b>триває 2 тижні.</b>"
             "\n✅ <b>Уроки відкриваються поступово</b> – більшість уроків містять кілька відео та тестів. Спочатку переглядаєш відео, проходиш тест, а після успішного складання <b>(80%</b> правильних відповідей) відкривається наступний урок."
             "\n✅ <b>Швидше пройти курс не вийде</b> – навіть якщо ти закінчив модуль раніше, доступ до наступного відкриється не раніше ніж через 2 тижні. "
             "\n✅ <b>Якщо не встиг за дедлайном</b>, доступ до навчання призупиняється. У тебе є 7 днів, щоб звернутися у підтримку (відновлення можливе лише раз і за поважних причин). Інакше доведеться почати спочатку.\n"
             "\n📌 <b>Що робити, якщо виникли питання?</b>\n "
             "🔹 Переглянь розділ <b>'Питання та відповіді'</b> – там зібрані найпоширеніші запитання."
             "\n🔹 Якщо відповіді немає – напиши в підтримку.\n"
             "\n💡 Будь зосередженим, <b>дотримуйся темпу</b> та отримуй максимум від навчання! Бот буде надсилати нагадування, тому <b>слідкуй за повідомленнями</b> та не відкладай навчання.")